posts/2011-11-23-thanksgiving.org
#+date: <2011-11-23>
#+title: Thanksgiving
#+filetags: misc

Thanksgiving should be an opportunity for reflection, not for the gluttony and sloth that has become the norm. One of my favorite Thanksgiving traditions to share the latest world hunger statistics with my Introduction to Philosophy class. I then urge the students to spend the break reading Ron Sider’s book, /Rich Christians in an Age of Hunger/.
    
This past week reminded me of how fortunate I am to be able to share my time with both students and colleagues. May their time away from campus this week be filled with rest, joy, and a renewed sense of God’s gracious love.
    


#+begin_tagline
Tagged: misc
#+end_tagline
