docs/posts/2011-11-23-thanksgiving.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thanksgiving</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Thanksgiving</h1>
<p class="subtitle" role="doc-subtitle">Nov 23, 2011</p>
</header><p>
Thanksgiving should be an opportunity for reflection, not for the gluttony and sloth that has become the norm. One of my favorite Thanksgiving traditions to share the latest world hunger statistics with my Introduction to Philosophy class. I then urge the students to spend the break reading Ron Sider’s book, <i>Rich Christians in an Age of Hunger</i>.
</p>

<p>
This past week reminded me of how fortunate I am to be able to share my time with both students and colleagues. May their time away from campus this week be filled with rest, joy, and a renewed sense of God’s gracious love.
</p>



<div class="tagline" id="org6f9f393">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
